In [11]:
import pandas as pd 

df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)})
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [16]:
df_group_by = df.groupby('key')
df_group_by[['data', 'key']].count()

     data  key
key
A       2    2
B       2    2
C       2    2

In [23]:
x = '6th august 2006 at 5 pm'
date = pd.to_datetime(x)
date.strftime("%A")

'Sunday'

TypeError: 'str' object cannot be interpreted as an integer